beginner-programs/FileUpload/test_UploadHandler_88ba7887f6_Test.yaml
# Test generated by RoostGPT for test TannerGabriel-learning-go-api-source using AI Type Open AI and AI Model gpt-4

config:
  target: "{{ $processEnvironment.API_HOST }}"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "test_UploadHandler_88ba7887f6_Test.csv"
    fields:
      - "field1"
      - "field2"
    skipHeader: true
  plugins:
    expect: {}

scenarios:
  - name: "Successful API request"
    flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            field1: "{{ field1 }}"
            field2: "{{ field2 }}"
          expect:
            - statusCode: 200
            - hasProperty: "success"
            - hasHeader: "Content-Type"

  - name: "API request with validation failure"
    flow:
      - post:
          url: "/invalid-url"
          headers:
            Content-Type: "application/json"
          json:
            field1: "{{ field1 }}"
            field2: "{{ field2 }}"
          expect:
            - statusCode: 400
            - hasProperty: "error"
            - hasHeader: "Content-Type"

  - name: "API request with edge case"
    flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            field1: "{{ field1 }}"
            field2: "{{ field2 }}"
          expect:
            - statusCode: "{{ $between(200, 299) }}"
            - hasProperty: "data"
            - hasHeader: "Content-Type"